In [1]:
import pandas as pd

In [2]:
train_df=pd.read_excel('data_set/Data_Train.xlsx')

In [3]:
train_df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302

In [76]:
train_df['Airline'].unique()

array(['IndiGo', 'Air India', 'Jet Airways', 'SpiceJet',
       'Multiple carriers', 'GoAir', 'Vistara', 'Air Asia',
       'Vistara Premium economy', 'Jet Airways Business',
       'Multiple carriers Premium economy', 'Trujet'], dtype=object)

# Data Preprocessing

In [4]:
# We have to do a lot of preprocessing beacuse most of the data types are strings.

In [5]:
train_df.shape

(10683, 11)

In [6]:
train_df.isnull().sum()

Airline            0
Date_of_Journey    0
Source             0
Destination        0
Route              1
Dep_Time           0
Arrival_Time       0
Duration           0
Total_Stops        1
Additional_Info    0
Price              0
dtype: int64

In [7]:
train_df.dropna(inplace=True) # Removing Nan
train_df.reset_index(inplace=True, drop=True)

In [8]:
train_df.shape

(10682, 11)

In [9]:
# Step by step preprocessing...

-------------Converting Airlines into numerical form. They are Nominal values(No oreder). So applying oneHot encoder.

In [10]:
train_df['Airline'].value_counts()

Jet Airways                          3849
IndiGo                               2053
Air India                            1751
Multiple carriers                    1196
SpiceJet                              818
Vistara                               479
Air Asia                              319
GoAir                                 194
Multiple carriers Premium economy      13
Jet Airways Business                    6
Vistara Premium economy                 3
Trujet                                  1
Name: Airline, dtype: int64

In [11]:
Airline_values=pd.get_dummies(train_df['Airline'], drop_first=True)

In [12]:
Airline_values.head()

,Air India,GoAir,IndiGo,Jet Airways,Jet Airways Business,Multiple carriers,Multiple carriers Premium economy,SpiceJet,Trujet,Vistara,Vistara Premium economy
0,0,0,1,0,0,0,0,0,0,0,0
1,1,0,0,0,0,0,0,0,0,0,0
2,0,0,0,1,0,0,0,0,0,0,0
3,0,0,1,0,0,0,0,0,0,0,0
4,0,0,1,0,0,0,0,0,0,0,0

--------------Converting Date of journey

In [13]:
train_df['journey_day']=pd.to_datetime(train_df['Date_of_Journey'], format="%d/%m/%Y").dt.day

In [14]:
train_df.head(2)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,journey_day
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897,24
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662,1

In [15]:
train_df['journey_month']=pd.to_datetime(train_df['Date_of_Journey'], format="%d/%m/%Y").dt.month

In [16]:
train_df.head(2)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,journey_day,journey_month
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897,24,3
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662,1,5

--------------Converting Source

In [17]:
train_df['Source'].value_counts()

Delhi       4536
Kolkata     2871
Banglore    2197
Mumbai       697
Chennai      381
Name: Source, dtype: int64

In [18]:
Source_value=pd.get_dummies(train_df['Source'], drop_first=True)

In [19]:
Source_value.head(2)

   Chennai  Delhi  Kolkata  Mumbai
0        0      0        0       0
1        0      0        1       0

--------------Converting Destination

In [20]:
train_df['Destination'].value_counts()

Cochin       4536
Banglore     2871
Delhi        1265
New Delhi     932
Hyderabad     697
Kolkata       381
Name: Destination, dtype: int64

In [21]:
Destination_value=pd.get_dummies(train_df['Destination'], drop_first=True)

In [22]:
Destination_value.head(2)

   Cochin  Delhi  Hyderabad  Kolkata  New Delhi
0       0      0          0        0          1
1       0      0          0        0          0

--------------Converting Dept & Arrival time

In [23]:
train_df['Dept_hr']=pd.to_datetime(train_df['Dep_Time']).dt.hour
train_df['Dept_min']=pd.to_datetime(train_df['Dep_Time']).dt.minute

In [24]:
train_df.head(2)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,journey_day,journey_month,Dept_hr,Dept_min
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897,24,3,22,20
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662,1,5,5,50

In [25]:
train_df['Arrival_hr']=pd.to_datetime(train_df['Arrival_Time']).dt.hour
train_df['Arrival_min']=pd.to_datetime(train_df['Arrival_Time']).dt.minute

In [26]:
train_df.head(2)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,journey_day,journey_month,Dept_hr,Dept_min,Arrival_hr,Arrival_min
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897,24,3,22,20,1,10
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662,1,5,5,50,13,15

--------------Converting Duration

In [27]:
# Duration is in string. Basically hrs and minutes are mentioned.
# We have to find it using a logic

In [28]:
train_df['Duration'].describe()

count      10682
unique       368
top       2h 50m
freq         550
Name: Duration, dtype: object

In [29]:
train_df['Duration'].value_counts()

2h 50m     550
1h 30m     386
2h 45m     337
2h 55m     337
2h 35m     329
          ...
41h 20m      1
32h 55m      1
30h 10m      1
47h          1
3h 25m       1
Name: Duration, Length: 368, dtype: int64

In [30]:
# train_df['Duration'].unique()

In [31]:
# Time taken by plane to reach destination is called Duration
# It is the differnce betwwen Departure Time and Arrival time


# Assigning and converting Duration column into list
duration = list(train_df["Duration"])

for i in range(len(duration)):
    if len(duration[i].split()) != 2:    # Check if duration contains only hour or mins
        if "h" in duration[i]:
            duration[i] = duration[i].strip() + " 0m"   # Adds 0 minute
        else:
            duration[i] = "0h " + duration[i]           # Adds 0 hour

duration_hours = []
duration_mins = []
for i in range(len(duration)):
    duration_hours.append(int(duration[i].split(sep = "h")[0]))    # Extract hours from duration
    duration_mins.append(int(duration[i].split(sep = "m")[0].split()[-1]))   # Extracts only minutes from duration

In [32]:
# Adding duration_hours and duration_mins list to train_data dataframe

train_df["Duration_hours"] = duration_hours
train_df["Duration_mins"] = duration_mins

In [33]:
train_df.head(2)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,journey_day,journey_month,Dept_hr,Dept_min,Arrival_hr,Arrival_min,Duration_hours,Duration_mins
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897,24,3,22,20,1,10,2,50
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662,1,5,5,50,13,15,7,25

--------------Converting Stops

In [34]:
# These are ordered values. So we can use Label encoding

In [35]:
train_df.replace({"non-stop": 0, "1 stop": 1, "2 stops": 2, "3 stops": 3, "4 stops": 4}, inplace = True)

In [36]:
# Concatinating all converted categorical cols and removing all unneccesary cols

In [37]:
# Concatinate Airline + Source + Destination
Data_train = pd.concat([train_df, Airline_values, Source_value, Destination_value], axis=1)

In [38]:
Data_train.head(2)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,...,Vistara Premium economy,Chennai,Delhi,Kolkata,Mumbai,Cochin,Delhi,Hyderabad,Kolkata,New Delhi
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,0,No info,...,0,0,0,0,0,0,0,0,0,1
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2,No info,...,0,0,0,1,0,0,0,0,0,0

In [39]:
Data_train.drop(["Airline", "Date_of_Journey", "Source", "Destination", "Route", 
                "Dep_Time", "Arrival_Time", "Duration", "Additional_Info"], axis = 1, inplace = True)

In [40]:
Data_train.head(2)

,Total_Stops,Price,journey_day,journey_month,Dept_hr,Dept_min,Arrival_hr,Arrival_min,Duration_hours,Duration_mins,...,Vistara Premium economy,Chennai,Delhi,Kolkata,Mumbai,Cochin,Delhi,Hyderabad,Kolkata,New Delhi
0,0,3897,24,3,22,20,1,10,2,50,...,0,0,0,0,0,0,0,0,0,1
1,2,7662,1,5,5,50,13,15,7,25,...,0,0,0,1,0,0,0,0,0,0

# Feature Selection

In [41]:
Data_train.shape

(10682, 30)

In [42]:
X=Data_train.drop(['Price'], axis=1)
y=Data_train['Price']

In [43]:
X.shape, y.shape

((10682, 29), (10682,))

In [44]:
y.head(2)

0    3897
1    7662
Name: Price, dtype: int64

# Model Creation

Basically we are going to try multiple models(Regression) on top is this data.
1. Decision Tree
2. Random Forest

In [45]:
from sklearn.model_selection import train_test_split

In [46]:
X_train, X_test, y_train, y_test=train_test_split(X, y, test_size=0.3)

In [47]:
X_train.shape, X_test.shape, y_train.shape, y_test.shape

((7477, 29), (3205, 29), (7477,), (3205,))

In [48]:
from sklearn.tree import DecisionTreeRegressor
from sklearn.ensemble import RandomForestRegressor

DT_model=DecisionTreeRegressor()
RF_model=RandomForestRegressor()

In [49]:
# Decision tree
DT_model.fit(X_train, y_train)
DT_pred=DT_model.predict(X_test)
DT_model.score(X_test, y_test)

0.7129485443354864

In [50]:
# Random Forest
RF_model.fit(X_train, y_train)
rf_pred=RF_model.predict(X_test)
RF_model.score(X_test, y_test)

C:\Users\ananthu.m1\AppData\Local\Continuum\anaconda3\lib\site-packages\sklearn\ensemble\forest.py:246: FutureWarning: The default value of n_estimators will change from 10 in version 0.20 to 100 in 0.22.
  "10 in version 0.20 to 100 in 0.22.", FutureWarning)

0.8025914637111131

# Hyper tuning RF
Since Random Forest gave high accuracy. We must increase its score by hyper tuning.

In [51]:
parameters = {
    "n_estimators":[5,10,50,100,250],
    "max_depth":[2,4,8,16,32,None]   
}

In [53]:
from sklearn.model_selection import RandomizedSearchCV
cv = RandomizedSearchCV(RF_model,parameters,cv=5)
cv.fit(X_train,y_train)

RandomizedSearchCV(cv=5, error_score='raise-deprecating',
          estimator=RandomForestRegressor(bootstrap=True, criterion='mse', max_depth=None,
           max_features='auto', max_leaf_nodes=None,
           min_impurity_decrease=0.0, min_impurity_split=None,
           min_samples_leaf=1, min_samples_split=2,
           min_weight_fraction_leaf=0.0, n_estimators=10, n_jobs=None,
           oob_score=False, random_state=None, verbose=0, warm_start=False),
          fit_params=None, iid='warn', n_iter=10, n_jobs=None,
          param_distributions={'n_estimators': [5, 10, 50, 100, 250], 'max_depth': [2, 4, 8, 16, 32, None]},
          pre_dispatch='2*n_jobs', random_state=None, refit=True,
          return_train_score='warn', scoring=None, verbose=0)

In [55]:
cv.best_params_

{'n_estimators': 250, 'max_depth': 16}

In [56]:
prediction = cv.predict(X_test)

In [58]:
cv.score(X_test, y_test)

0.8204548219226435

# Saving the model

In [65]:
import pickle
f = open('Flight_RF_model.pkl', 'wb')
pickle.dump(cv, f)